OpenFOAM-6-cantera-openmpi/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/filmRegion/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name outlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f0;
    }
    {
        name side1;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f1;
    }
    {
        name inlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f2;
    }
    {
        name side2;

        patchInfo
        {
            type        patch;
        }

        constructFrom set;

        set f3;
    }
);

// ************************************************************************* //
