OpenFOAM-6-cantera-openmpi/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            fixedValue;
        value           $internalField;
    }

    side
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.01;
        value           uniform (0 0 0);
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedFlowRate;
        nbrPhi          phiGas;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
